const { sendMessage, removeMessage } = require('../helpers/message');
const { homeOption } = require('../const/dictionary');

const moduleActionName = 'rules';
const startActionName = 'start';
const chatSectionName = 'chat';
const silentSectionName = 'silent';

const startAction = async (ctx, bot, needAnswer) => {
    const messageText =
        '📚 Правила\n\n' +
        'В этом разделе собраны основные правила.\n' +
        'Для ознакомления с текстами правил воспользуйтесь кнопками ниже.';

    const buttons = {
        [`${moduleActionName}:${chatSectionName}`]: 'Правила чата',
        [`${moduleActionName}:${silentSectionName}`]: 'Режим тишины',
    };

    await sendMessage(ctx, {
        text: messageText,
        buttons: {
            ...buttons,
            ...homeOption,
        },
    });

    await removeMessage(ctx);

    if (needAnswer) {
        await ctx.answerCbQuery();
    }
};


const sectionSelectHandler = async (ctx, sectionName) => {
    let text = '';
    const buttons = {
        [`${moduleActionName}_${startActionName}`]: '⬅️ Назад',
        ...homeOption,
    };

    if (sectionName === chatSectionName) {
        text =
            '📖 Правила чата\n\n' +
            'В целях поддержания порядка и сохранения атмосферы взаимного уважения администрацией группы установлены правила общения и предусмотрены меры ответственности за их нарушение. В отдельных случаях к участникам могут применяться меры блокировки.\n\n' +
            '<b>Блокировка может быть применена, в том числе, в следующих ситуациях:</b>\n' +
            '❗распространение персональных данных других участников;\n' +
            '❗размещение рекламных, пригласительных материалов, акций и иного спама;\n' +
            '❗️призывы к противоправным действиям;\n' +
            '❗️проявление неуважения, оскорблений или агрессии в адрес членов сообщества;\n' +
            '❗️умышленные попытки дезинформации или провокации паники.\n\n' +
            'Срок блокировки определяется администрацией в зависимости от характера и тяжести нарушения и может составлять от 24 часов до бессрочного исключения из чата.\n\n' +
            '<b>Просим всех участников соблюдать корректность и уважительное отношение друг к другу.</b>';
    }

    if (sectionName === silentSectionName) {
        text =
            '📖 <a href="https://www.consultant.ru/cons/cgi/online.cgi?from=99521-25&req=doc&base=SPB&n=319748">Режим тишины </a>\n\n' +
            '<b>В Санкт-Петербурге запрещено шуметь:</b>\n' +
            '• с 22:00 до 08:00 в будние дни;\n' +
            '• с 22:00 до 12:00 в выходные и праздничные дни.\n\n' +
            'К шуму относятся громкая музыка, крики, использование звукоусиливающей техники, ремонтные работы и другие действия, нарушающие покой граждан.\n\n' +
            '<b>Ремонтные работы разрешены:</b>\n' +
            '• с 09:00 до 19:00\n' +
            '• с перерывом с 13:00 до 15:00\n\n' +
            '<b>Просим с уважением относиться друг к другу!</b>\n\n';
    }

    await sendMessage(ctx, {
        text,
        buttons,
    });

    await removeMessage(ctx);

    await ctx.answerCbQuery();
}

const callbackHandler = async (ctx, next) => {
    const data = ctx.callbackQuery.data;
    const [action, sectionName] = data.split(':');

    if (action === moduleActionName) {
        await sectionSelectHandler(ctx, sectionName);
    }

    return next();
};


module.exports = (bot) => {
    bot.command(`${moduleActionName}_${startActionName}`, async (ctx) => startAction(ctx, bot));
    bot.action(`${moduleActionName}_${startActionName}`, async (ctx) => startAction(ctx, bot, true));
    bot.on('callback_query', async (ctx, next) => callbackHandler(ctx, next));
};
