const { sendMessage, sendLocalFileMessage, removeMessage, commandAnswer } = require('../helpers/telegraf');
const { setStatisticsData } = require('../helpers/db');

const { homeOption, closeOption, moduleNames } = require('../const/dictionary');

const moduleParam = {
    name: moduleNames.rules,
    keywords: ['правила'],
    chat: 'chat',
    silent: 'silent',
    dog: 'dog',
};

const initAction = async (ctx, { isHearsAction } = {}) => {
    await setStatisticsData(isHearsAction ? 'rules-hears' : 'rules-start');

    const messageText =
        '📚 Правила\n\n' +
        'В этом разделе собраны основные правила.\n' +
        'Для ознакомления с текстами правил воспользуйтесь кнопками ниже.';

    const buttons = {
        [`${moduleParam.name}:${moduleParam.chat}`]: 'Правила чата',
        [`${moduleParam.name}:${moduleParam.silent}`]: 'Закон о тишине',
        [`${moduleParam.name}:${moduleParam.dog}`]: 'Закон о содержании собак',
    };

    const isPrivateChat = ctx.chat?.type === 'private';

    await sendMessage(ctx, {
        text: messageText,
        buttons: {
            ...buttons,
            ...(isPrivateChat ? homeOption : {}),
            ...(!isPrivateChat ? closeOption : {}),
        },
    });

    await removeMessage(ctx);
    await commandAnswer(ctx);
};


const ruleSelectHandler = async (ctx, sectionName) => {
    await setStatisticsData(`rules-get:${sectionName}`);

    let text = '';

    const isPrivateChat = ctx.chat?.type === 'private';

    const buttons = {
        [moduleParam.name]: '⬅️ Назад',
        ...(!isPrivateChat ? closeOption : {}),
    };


    const filePaths = {
        [moduleParam.silent]: './assets/273_70.pdf',
        [moduleParam.dog]: './assets/588_110.pdf',
    };

    if (sectionName === moduleParam.chat) {
        text =
            '📖 Правила чата\n\n' +
            'Данные правила установлены администрацией чата с целью поддержания комфортной, безопасной и уважительной атмосферы общения для всех участников. Участие в чате означает автоматическое согласие с настоящими правилами.\n\n' +
            '<b>🚫 Запрещается:</b>\n' +
            '<blockquote>• Распространение персональных данных других участников без их явного согласия (адреса, номера телефонов, личные переписки, аккаунты и т.п.);\n' +
            '• Размещение рекламы, пригласительных ссылок, акций, а также любого вида спама без разрешения администрации;\n' +
            '• Призывы к противоправным действиям, обсуждение или пропаганда незаконной деятельности;\n' +
            '• Оскорбления, агрессия, травля, проявление неуважения по отношению к участникам, администрации или третьим лицам;\n' +
            '• Умышленная дезинформация, распространение ложных сведений, провокации паники или конфликтов.</blockquote>\n\n' +
            '<b>🔕 Режим тишины и отдыха:</b>\n' +
            '<blockquote>• Просим участников соблюдать правила тишины и уважать личное время других;\n' +
            '• Активное общение в чате рекомендуется с 09:00 до 22:00;\n' +
            '• В период с 22:00 до 09:00 просьба воздерживаться от сообщений, не требующих срочного внимания.</blockquote>\n\n' +
            '<b>⚖️ Ответственность и меры:</b>\n' +
            '<blockquote>• За нарушение правил администрация вправе вынести предупреждение;\n' +
            '• В зависимости от характера и тяжести нарушения может быть применена временная блокировка (от 24 часов);\n' +
            '• В случае грубых или повторных нарушений возможна бессрочная блокировка и исключение из чата без дополнительного уведомления;\n' +
            '• Администрация оставляет за собой право принимать решения в индивидуальном порядке.</blockquote>\n\n' +
            '<b>🤝 Общие рекомендации::</b>\n' +
            '<blockquote>• Соблюдайте корректность и уважительное отношение друг к другу;\n' +
            '• Учитывайте, что в чате могут находиться люди с разными взглядами и мнениями; \n' +
            '• При возникновении спорных ситуаций обращайтесь к администрации, а не провоцируйте конфликты.</blockquote>';
    }

    if (sectionName === moduleParam.silent) {
        text =
            '📖 Закон Санкт-Петербурга №273-70 о тишине\n\n' +
            '<b>В Санкт-Петербурге запрещено шуметь:</b>\n' +
            '<blockquote>• С 22:00 до 08:00 в будние дни;\n' +
            '• С 22:00 до 12:00 в выходные и праздничные дни.</blockquote>\n\n' +
            'К шуму относятся громкая музыка, крики, использование звукоусиливающей техники, ремонтные работы и другие действия, нарушающие покой граждан.\n\n' +
            '<b>Ремонтные работы разрешены:</b>\n' +
            '<blockquote>• С 09:00 до 19:00\n' +
            '• С перерывом с 13:00 до 15:00</blockquote>';
    }

    if (sectionName === moduleParam.dog) {
        text =
            '📖 Закон Санкт-Петербурга №588-110 о содержании собак\n\n' +
            '<b>Поводок.</b>\n' +
            '<blockquote>• Все собаки вне места содержания обязаны находиться на поводке.</blockquote>\n\n' +
            '<b>Намордник.</b>\n' +
            '<blockquote>• Собаки ростом выше 40 см в холке и признанные потенциально опасными породами должны быть и в наморднике при выгуле.</blockquote>\n\n' +
            '<b>Длина поводка.</b>\n' +
            '<blockquote>• В многоквартирных домах закон требует, чтобы крупные / опасные собаки находились не далее определённого расстояния от владельца (примерно 80 см).</blockquote>\n\n' +
            '<b>Запреты по условиям и возрасту.</b>\n' +
            '<blockquote>• Детям до 16 лет без сопровождения взрослого запрещено выгуливать крупных или опасных собак.\n' +
            '• Запрещено выгуливать нескольких крупных / опасных собак одновременно.\n' +
            '• Нельзя выгуливать собак в состоянии алкогольного или наркотического опьянения.</blockquote>\n\n' +
            '<b>Уборка за животным.</b>\n' +
            '<blockquote>• Владельцы обязаны убирать продукты жизнедеятельности своего питомца на территории общего пользования.</blockquote>\n\n' +
            '<b>Запреты на определённых объектах.</b>\n' +
            '<blockquote>Дополнительно запрещён выгул на детских и спортивных площадках, у учреждений образования и здравоохранения.</blockquote>';
    }

    if (filePaths[sectionName]) {
        await sendLocalFileMessage(ctx, { text, buttons, filePath: filePaths[sectionName] });
    } else {
        await sendMessage(ctx, { text, buttons });
    }

    await removeMessage(ctx);
    await commandAnswer(ctx);
};

const callbackHandler = async (ctx, next) => {
    const data = ctx.callbackQuery.data;
    const [action, sectionName] = data.split(':');

    if (action === moduleParam.name) {
        await ruleSelectHandler(ctx, sectionName);
    }

    return next();
};

module.exports = (bot) => {
    bot.hears(moduleParam.keywords, (ctx) => initAction(ctx, { isHearsAction: true }));
    bot.command(moduleParam.name, (ctx) => initAction(ctx));
    bot.action(moduleParam.name, (ctx) => initAction(ctx));
    bot.on('callback_query', (ctx, next) => callbackHandler(ctx, next));
};
