const stepList = [
    {
        id: 'message',
        text: '🟢 Введите текст сообщения. При необходимости в тексте сообщения укажите номер квартиры и контактный телефон',
        errorText: '🟡 Пожалуйста, введите текст сообщения',
        validation: {
            min: 2,
            dataType: 'message',
        },
    },
    {
        id: 'summary',
        text: '🟢 Данные подготовлены.',
        summary: {
            message: 'Сообщение: ',
        }
    },
];

module.exports = {
    stepList,
};