const stepList = [
    {
        id: 'room',
        text: '🟢 Введите номер Вашей квартиры',
        errorText: '🟡 Введите номер Вашей квартиры',
        validation: {
            min: 0,
            max: 667,
            dataType: 'int',
        },
    },
    {
        id: 'userName',
        text: '🟢 Введите Вашу фамилию и имя',
        errorText: '🟡 Введите Вашу фамилию и имя',
        validation: {
            min: 2,
            dataType: 'text',
        },
    },
    {
        id: 'kitchenCold',
        text: '🟢 Введите показания счетчика: холодная вода (кухня)',
        errorText: '🟡 Введите показания счетчика: холодная вода (кухня)',
        validation: {
            min: 0,
            dataType: 'float',
        },
    },
    {
        id: 'kitchenHot',
        text: '🟢 Введите показания счетчика: горячая вода (кухня)',
        errorText: '🟡 Введите показания счетчика: горячая вода (кухня)',
        validation: {
            min: 0,
            dataType: 'float',
        },
    },
    {
        id: 'toiletCold',
        text: '🟢 Введите показания счетчика: холодная вода (туалет)',
        errorText: '🟡 Введите показания счетчика: холодная вода (туалет)',
        validation: {
            min: 0,
            dataType: 'float',
        },
    },
    {
        id: 'toiletHot',
        text: '🟢 Введите показания счетчика: горячая вода (туалет)',
        errorText: '🟡 Введите показания счетчика: горячая вода (туалет)',
        validation: {
            min: 0,
            dataType: 'float',
        },
    },
    {
        id: 'summary',
        text: '🟢 Данные подготовлены.',
        summary: {
            room: 'Номер квартиры: ',
            userName: 'ФИО отправителя: ',
            kitchenCold: '\nХолодная вода (кухня): ',
            kitchenHot: 'Горячая вода (кухня): ',
            toiletCold: 'Холодная вода (туалет): ',
            toiletHot: 'Горячая вода (туалет): ',
        }
    },
];

module.exports = {
    stepList,
};