const stepList = [
    {
        id: 'room',
        text: '🟢 Введите номер Вашей квартиры',
        errorText: '🟡 Введите номер Вашей квартиры',
        validation: {
            min: 0,
            max: 667,
            dataType: 'int',
        },
    },
    {
        id: 'owner',
        text: '🟢 Введите Фамилию собственника квартиры',
        errorText: '🟡 Введите Фамилию собственника квартиры',
        validation: {
            min: 1,
            dataType: 'text',
        },
    },
    {
        id: 'summary',
        text: '🟢 Данные подготовлены.',
        summary: {
            room: 'Номер квартиры: ',
            owner: 'ФИО собственника: ',
        }
    },
];

module.exports = {
    stepList,
};