const weatherCodeDetails = {
    0: { image: 'sunny', icon: '☀️', text: 'Ясно' },
    1: { image: 'sunny', icon: '🌤', text: 'Преимущественно ясно' },
    2: { image: 'sunny', icon: '⛅', text: 'Переменная облачность' },
    3: { image: 'cloud', icon: '☁️', text: 'Пасмурно' },

    45: { image: 'fog', icon: '💨', text: 'Туман' },
    48: { image: 'fog', icon: '💨❄️', text: 'Туман с инеем' },

    51: { image: 'rain', icon: '🌦', text: 'Слабая морось' },
    53: { image: 'rain', icon: '🌦', text: 'Умеренная морось' },
    55: { image: 'rain', icon: '🌧', text: 'Сильная морось' },
    56: { image: 'rain', icon: '🌧❄️', text: 'Слабая ледяная морось' },
    57: { image: 'rain', icon: '🌧❄️', text: 'Сильная ледяная морось' },

    61: { image: 'rain', icon: '🌧', text: 'Слабый дождь' },
    63: { image: 'rain', icon: '🌧', text: 'Умеренный дождь' },
    65: { image: 'rain', icon: '🌧🌧', text: 'Сильный дождь' },
    66: { image: 'rain', icon: '🌧❄️', text: 'Слабый ледяной дождь' },
    67: { image: 'rain', icon: '🌧❄️', text: 'Сильный ледяной дождь' },

    71: { image: 'rain', icon: '🌨', text: 'Слабый снег' },
    73: { image: 'rain', icon: '🌨', text: 'Умеренный снег' },
    75: { image: 'rain', icon: '❄️❄️', text: 'Сильный снег' },
    77: { image: 'rain', icon: '❄️', text: 'Снежная крупа' },

    80: { image: 'rain', icon: '🌧', text: 'Слабые ливни' },
    81: { image: 'rain', icon: '🌧🌧', text: 'Умеренные ливни' },
    82: { image: 'rain', icon: '🌧🌧🌧', text: 'Сильные ливни' },

    85: { image: 'rain', icon: '🌨', text: 'Слабый снегопад' },
    86: { image: 'rain', icon: '❄️❄️', text: 'Сильный снегопад' },

    95: { image: 'storm', icon: '🌩️', text: 'Гроза' },
    96: { image: 'storm', icon: '🌩️🌨', text: 'Гроза с градом' },
    99: { image: 'storm', icon: '🌩️⛈️❄️', text: 'Сильная гроза с градом' },

    undefined: { image: 'sunny', icon: '🌤', text: 'Неизвестно' },
};

module.exports = {
    weatherCodeDetails,
}